<!DOCTYPE html>
<html>
<head>
    <meta charset="utf-8">
    <title>include命令 - honkaku</title>
</head>
<body>
    <h3>バナー広告がたくさんある記事ページ</h3>
    <p>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
    </p>
    <?php include(dirname(__FILE__) . '/files/banner-ad1.html'); ?>
    <p>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
    </p>
    <?php include(dirname(__FILE__) . '/files/banner-ad2.html'); ?>
    <p>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
    </p>
    <?php include(dirname(__FILE__) . '/files/banner-ad3.html'); ?>
    <p>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
        ここに記事のテキストが入ります。ここに記事のテキストが入ります。<br>
    </p>
    <?php include(dirname(__FILE__) . '/files/banner-ad1.html'); ?>
</body>
</html>
