<!DOCTYPE html>
<html>
<head>
    <meta charset="utf-8">
    <title>foreachでリファレンス渡しを使ったループ - honkaku</title>
</head>
<body>
    <?php
    // 30度を超えた日が連続したのが一番長い
        // $temperatures = [ 25.7, 27.2, 26.3, 28.8, 30.5, 27.9, 29.5, 28.6, 28.5, 31.0, 24.8, 29.8, 26.3, 25.5, 29.2, 30.4, 30.3, 29.3, 26.3, 29.9, 30.3, 28.1, 32.0, 31.8, 32.1, 34.1, 29.1, 31.7, 32.9, 33.1, 34.8, 35.2, 36.5, 34.1, 33.0, 36.2, 34.9, 34.0, 32.3, 33.3, 34.5, 34.4, 36.7, 36.6, 35.6, 32.2, 31.2, 33.2, 33.7, 31.1, 30.6, 31.7, 31.9, 29.3, 28.9, 30.5, 29.6, 26.9, 27.5, 29.8, 28.2, 28.4, 29.0, 31.8, 31.2, 32.5, 33.2, 33.7, 34.7, 35.1, 32.3, 33.4, 32.7, 30.6, 26.9, 31.6, 32.5, 32.0, 31.9, 30.7, 27.6, 27.2, 25.1, 28.5, 28.9, 25.5, 28.4, 30.1, 29.2, 29.0, 29.9, 30.6];
        $temperatures = [31, 33, 22, 31, 34, 30, 40, 55, 0, 31, 23, 32, 32];

        // 基準になる気温
        $base = 30;
        // $thirty_degrees[] = '';
        // $max[] = '';

        // 配列から気温を順に取り出す
        foreach ($temperatures as $temperature){
            if ($temperature >= 30){
                // 30度以上の日だけ、再び変数に保管する
                $thirty_degrees[] = $temperature;

            } elseif ($temperature < $base){
                // // 30度以下なら、今までの最高記録として保管してぬける
                // $max[] = $thirty_degrees;
                break;
            }
            $result = count($thirty_degrees);
            // 今までの最高と、比較して、大きかったら、入れ替える

        }
        echo '30度超えた日'.$result.'日続いた';
    ?>
</body>
</html>
